; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_1 ?v9 ?v1)
             (pred_8 ?v10 ?v2)
             (pred_4 ?v9 ?v2)
             (pred_10 ?v7 ?v9 )
	     (pred_3 ?v9)
             (pred_6 ?v11)
             (pred_11 ?v10)
             (pred_5 ?v2)
             (pred_12 ?v9)
             (pred_9 ?v10)
             (pred_7 ?v9)
             (pred_2 ))



(:action op_3
:parameters (?v13 ?v3 ?v4 ?v5)
:precondition (and (pred_6 ?v13) (pred_6 ?v3) (pred_11 ?v4) (pred_5 ?v5)
          (pred_1 ?v13 ?v3) (pred_8 ?v4 ?v5)
                   (pred_4 ?v3 ?v5) (pred_3 ?v13) 
                   (pred_12 ?v3) (pred_9 ?v4))
:effect (and  (pred_7 ?v3) (not (pred_12 ?v3))))


(:action op_1
:parameters (?v13 ?v8)
:precondition (and (pred_6 ?v13) (pred_6 ?v8)
               (pred_3 ?v13) (pred_1 ?v13 ?v8) (pred_7 ?v8))
:effect (and (pred_3 ?v8) (not (pred_3 ?v13))))

(:action op_4
:parameters (?v13 ?v4)
:precondition (and (pred_6 ?v13) (pred_11 ?v4) 
                  (pred_3 ?v13) (pred_10 ?v4 ?v13) (pred_2 ))
:effect (and (pred_9 ?v4)
   (not (pred_10 ?v4 ?v13)) (not (pred_2 ))))


(:action op_2
:parameters (?v13 ?v12 ?v6)
:precondition (and (pred_6 ?v13) (pred_11 ?v12) (pred_11 ?v6)
                  (pred_3 ?v13) (pred_9 ?v6) (pred_10 ?v12 ?v13))
:effect (and (pred_9 ?v12) (pred_10 ?v6 ?v13)
        (not (pred_9 ?v6)) (not (pred_10 ?v12 ?v13))))

(:action op_5
:parameters (?v13 ?v4)
:precondition (and (pred_6 ?v13) (pred_11 ?v4) 
                  (pred_3 ?v13) (pred_9 ?v4))
:effect (and (pred_2 ) (pred_10 ?v4 ?v13) (not (pred_9 ?v4)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_18 obj_17 obj_01 obj_14 obj_05 obj_28 obj_03 obj_09 obj_08 obj_21 obj_16 obj_06 obj_29 obj_11 obj_20 obj_22 obj_13 obj_31 obj_12 obj_30 obj_23 obj_26 obj_19 obj_25 obj_24
    obj_04 obj_15 obj_10
    obj_27 obj_07 obj_02
    )

    (:init
       (pred_2)

       (pred_6 obj_18)
       (pred_6 obj_17)
       (pred_6 obj_01)
       (pred_6 obj_14)
       (pred_6 obj_05)
       (pred_6 obj_28)
       (pred_6 obj_03)
       (pred_6 obj_09)
       (pred_6 obj_08)
       (pred_6 obj_21)
       (pred_6 obj_16)
       (pred_6 obj_06)
       (pred_6 obj_29)
       (pred_6 obj_11)
       (pred_6 obj_20)
       (pred_6 obj_22)
       (pred_6 obj_13)
       (pred_6 obj_31)
       (pred_6 obj_12)
       (pred_6 obj_30)
       (pred_6 obj_23)
       (pred_6 obj_26)
       (pred_6 obj_19)
       (pred_6 obj_25)
       (pred_6 obj_24)
       (pred_5 obj_04)
       (pred_5 obj_15)
       (pred_5 obj_10)
       (pred_11 obj_27)
       (pred_11 obj_07)
       (pred_11 obj_02)

       (pred_1 obj_18 obj_28)
       (pred_1 obj_18 obj_17)
       (pred_1 obj_17 obj_03)
       (pred_1 obj_17 obj_01)
       (pred_1 obj_17 obj_18)
       (pred_1 obj_01 obj_09)
       (pred_1 obj_01 obj_14)
       (pred_1 obj_01 obj_17)
       (pred_1 obj_14 obj_08)
       (pred_1 obj_14 obj_05)
       (pred_1 obj_14 obj_01)
       (pred_1 obj_05 obj_21)
       (pred_1 obj_05 obj_14)
       (pred_1 obj_28 obj_16)
       (pred_1 obj_28 obj_03)
       (pred_1 obj_28 obj_18)
       (pred_1 obj_03 obj_06)
       (pred_1 obj_03 obj_09)
       (pred_1 obj_03 obj_17)
       (pred_1 obj_03 obj_28)
       (pred_1 obj_09 obj_29)
       (pred_1 obj_09 obj_08)
       (pred_1 obj_09 obj_01)
       (pred_1 obj_09 obj_03)
       (pred_1 obj_08 obj_11)
       (pred_1 obj_08 obj_21)
       (pred_1 obj_08 obj_14)
       (pred_1 obj_08 obj_09)
       (pred_1 obj_21 obj_20)
       (pred_1 obj_21 obj_05)
       (pred_1 obj_21 obj_08)
       (pred_1 obj_16 obj_22)
       (pred_1 obj_16 obj_06)
       (pred_1 obj_16 obj_28)
       (pred_1 obj_06 obj_13)
       (pred_1 obj_06 obj_29)
       (pred_1 obj_06 obj_03)
       (pred_1 obj_06 obj_16)
       (pred_1 obj_29 obj_31)
       (pred_1 obj_29 obj_11)
       (pred_1 obj_29 obj_09)
       (pred_1 obj_29 obj_06)
       (pred_1 obj_11 obj_12)
       (pred_1 obj_11 obj_20)
       (pred_1 obj_11 obj_08)
       (pred_1 obj_11 obj_29)
       (pred_1 obj_20 obj_30)
       (pred_1 obj_20 obj_21)
       (pred_1 obj_20 obj_11)
       (pred_1 obj_22 obj_23)
       (pred_1 obj_22 obj_13)
       (pred_1 obj_22 obj_16)
       (pred_1 obj_13 obj_26)
       (pred_1 obj_13 obj_31)
       (pred_1 obj_13 obj_06)
       (pred_1 obj_13 obj_22)
       (pred_1 obj_31 obj_19)
       (pred_1 obj_31 obj_12)
       (pred_1 obj_31 obj_29)
       (pred_1 obj_31 obj_13)
       (pred_1 obj_12 obj_25)
       (pred_1 obj_12 obj_30)
       (pred_1 obj_12 obj_11)
       (pred_1 obj_12 obj_31)
       (pred_1 obj_30 obj_24)
       (pred_1 obj_30 obj_20)
       (pred_1 obj_30 obj_12)
       (pred_1 obj_23 obj_26)
       (pred_1 obj_23 obj_22)
       (pred_1 obj_26 obj_19)
       (pred_1 obj_26 obj_13)
       (pred_1 obj_26 obj_23)
       (pred_1 obj_19 obj_25)
       (pred_1 obj_19 obj_31)
       (pred_1 obj_19 obj_26)
       (pred_1 obj_25 obj_24)
       (pred_1 obj_25 obj_12)
       (pred_1 obj_25 obj_19)
       (pred_1 obj_24 obj_30)
       (pred_1 obj_24 obj_25)
       (pred_12 obj_03)
       (pred_12 obj_21)
       (pred_12 obj_12)
       (pred_4  obj_03 obj_04)
       (pred_4  obj_21 obj_15)
       (pred_4  obj_12 obj_10)
       (pred_7 obj_18)
       (pred_7 obj_17)
       (pred_7 obj_01)
       (pred_7 obj_14)
       (pred_7 obj_05)
       (pred_7 obj_28)
       (pred_7 obj_09)
       (pred_7 obj_08)
       (pred_7 obj_16)
       (pred_7 obj_06)
       (pred_7 obj_29)
       (pred_7 obj_11)
       (pred_7 obj_20)
       (pred_7 obj_22)
       (pred_7 obj_13)
       (pred_7 obj_31)
       (pred_7 obj_30)
       (pred_7 obj_23)
       (pred_7 obj_26)
       (pred_7 obj_19)
       (pred_7 obj_25)
       (pred_7 obj_24)

       (pred_8  obj_27 obj_04)
       (pred_8  obj_07 obj_15)
       (pred_8  obj_02 obj_10)
       (pred_10 obj_27 obj_19)
       (pred_10 obj_07 obj_17)
       (pred_10 obj_02 obj_08)
       (pred_3 obj_16)
    )

    (:goal (and
       (pred_10 obj_07 obj_19)
    ))
(:constraints
  (always (not (pred_3 obj_29)))
)
)

; plan
1. (op_1 obj_16 obj_28)
   deleted: (pred_3 obj_16)
   added: (pred_3 obj_28)
   goals met: 0 of 1
2. (op_1 obj_28 obj_18)
   deleted: (pred_3 obj_28)
   added: (pred_3 obj_18)
   goals met: 0 of 1
3. (op_1 obj_18 obj_17)
   deleted: (pred_3 obj_18)
   added: (pred_3 obj_17)
   goals met: 0 of 1
4. (op_4 obj_17 obj_07)
   deleted: (pred_10 obj_07 obj_17) (pred_2)
   added: (pred_9 obj_07)
   goals met: 0 of 1
5. (op_1 obj_17 obj_01)
   deleted: (pred_3 obj_17)
   added: (pred_3 obj_01)
   goals met: 0 of 1
6. (op_1 obj_01 obj_09)
   deleted: (pred_3 obj_01)
   added: (pred_3 obj_09)
   goals met: 0 of 1
7. (op_1 obj_09 obj_08)
   deleted: (pred_3 obj_09)
   added: (pred_3 obj_08)
   goals met: 0 of 1
8. (op_1 obj_08 obj_11)
   deleted: (pred_3 obj_08)
   added: (pred_3 obj_11)
   goals met: 0 of 1
9. (op_1 obj_11 obj_20)
   deleted: (pred_3 obj_11)
   added: (pred_3 obj_20)
   goals met: 0 of 1
10. (op_1 obj_20 obj_30)
   deleted: (pred_3 obj_20)
   added: (pred_3 obj_30)
   goals met: 0 of 1
11. (op_1 obj_30 obj_24)
   deleted: (pred_3 obj_30)
   added: (pred_3 obj_24)
   goals met: 0 of 1
12. (op_1 obj_24 obj_25)
   deleted: (pred_3 obj_24)
   added: (pred_3 obj_25)
   goals met: 0 of 1
13. (op_1 obj_25 obj_19)
   deleted: (pred_3 obj_25)
   added: (pred_3 obj_19)
   goals met: 0 of 1
14. (op_2 obj_19 obj_27 obj_07)
   deleted: (pred_9 obj_07) (pred_10 obj_27 obj_19)
   added: (pred_9 obj_27) (pred_10 obj_07 obj_19)
   goals met: 1 of 1
